app/views/users/show.html.erb

<p><%= @user.username %> | <%= link_to 'Edit', edit_user_path(@user) %></p>
<% if @user.articles.length != 0 %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]