app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Article create 4"], ["description", "Create new article number four"], ["created_at", "2022-10-10 11:37:34.183354"], ["updated_at", "2022-10-10 11:37:34.183354"]]