app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["username", "new user"], ["email", "newuse@eg.com"], ["created_at", "2022-10-12 11:59:03.637452"], ["updated_at", "2022-10-12 11:59:03.637452"], ["password", "password"]]
---
  def create
    @user = User.new(user_params)
    if @user.save